[
  {
    "id": 1,
    "name": "Ameera Aftab",
    "grade": "Junior, Class of 2026",
    "position": "President",
    "major": "Communication and Global Development",
    "photo": "/ameera-aftab.jpg",
    "bio": "My name is Ameera Aftab, and I’m running for Student Assembly President because this is a crucial year for student funding—our money, our priorities. The Student Assembly controls millions in funding, and it’s time that funding goes where students actually need it.   I will push for better meal plan options, including Trillium meal swipe access, more blue lights and campus safety measures, protections for Greek Life, and stronger funding for cultural and religious organizations. Mental health support, financial aid advocacy, and improved transportation must also be priorities. Students should have a real say in how our money is spent, and I will ensure transparency and accountability in every decision.   As a current Student Assembly Representative, CALS Dean’s Council member, and former State University of New York Student Assembly Chair, I’ve fought for student-centered policies statewide and nationwide for 1.3 million+ students.   Now, I’m ready to bring that same dedication to the Cornell Student Assembly, ensuring the presidency serves as a true voice for all students—not just a platform for personal opinions. Together, we can build a stronger, safer, and more inclusive Cornell.",
    "sources": ["https://assembly.cornell.edu/president"]
  },
  {
    "id": 2,
    "name": "Zora deRham",
    "grade": "Sophomore, Class of 2027",
    "position": "President",
    "major": "Agricultural Sciences",
    "photo": "/zora-derham.jpg",
    "bio": "Honored to serve as your Student Assembly President, I’ve successfully advocated for meaningful enhancements to campus life. I ask for your vote so I may continue driving real change impacting your Cornell experience.   Partnering with Student Athlete leadership, we gained meal swipe access at Trillium, benefiting all students. To make life more affordable, I’m partnering with the Board of Trustees to include laundry in our housing package and pioneered discussions on adjusting off-campus financial aid stipends for inflation.   Continuing work with Anabel’s leadership, I’ll ensure it remains viable and continues to offer affordable, nutritious food for us. As well, I seek to secure parking access for students whose commitments – whether athletics, arts, or work – require them to be on campus often; no more expensive parking tickets.   Accountability is key. Next year, I’ll increase transparency in the byline funding process for student organizations. An allocation of $6M is on the horizon; you have every right to know why and how your money is being spent. I remain committed to strategic planning, conflict resolution, and keeping student interests at the heart of every decision.   Vote Zora deRham as your first choice for President.",
    "sources": ["https://assembly.cornell.edu/president"]
  },
  {
    "id": 3,
    "name": "Christian Flournoy",
    "grade": "Sophomore, Class of 2027",
    "position": "President",
    "major": "Human Biology, Health & Society",
    "photo": "/christian-flournoy.jpg",
    "bio": "My name is Christian Flournoy, and I am running to be your Student Assembly President. Since my freshman year, I have been committed to the betterment of the Cornell community through the Student Assembly as Freshman Rep, Undergraduate Rep At-Large, and Vice President of DEI. So far, I have effectively served the community through resolutions geared toward mental health, financial support, community representation, and more. The future of the Student Assembly—and Cornell as a whole—requires a new framework that prioritizes maximizing student voice and community representation. As President, I am focused on providing the student body with Transparency, Engagement, and Advocacy. Transparency of pending resolutions, assembly functionality, and more is necessary to reinstill trust within the community and ensure people understand how we are representing them. Increased engagement of student organizations, campus leadership, and the general student body will ensure that the Student Assembly can more accurately represent the Cornell community. Advocacy has been at the heart of my work since the beginning, and I will continue to be an advocate for you and your desires. I hope to represent you as your next Student Assembly President.",
    "sources": ["https://assembly.cornell.edu/president"]
  },
  {
    "id": 4,
    "name": "Eddy Pang",
    "grade": "Freshman, Class of 2028",
    "position": "President",
    "major": "Public Policy",
    "photo": "/eddy-pang.jpg",
    "bio": "My name is Eddy, and I'm honored to be a candidate for Student Assembly President!   Last August, I moved 1,000 miles from my home in Alabama to New York. Since then, I've been fortunate to learn, connect, and grow within our community. Now, I believe it's time to continue strengthening the student community, and I hope to be at the forefront of that change.    My goal is simple: to listen and ensure everyone is valued. By embracing diverse perspectives, we can craft a truly memorable and impactful experience for all. I hope to expand on a Student Assembly that cherishes engagement and authenticity, whether through increased North Campus student outreach or West Campus town halls. From supporting under-appreciated sports and clubs to fostering a genuine learning environment, we can create a strong campus identity that serves the needs of all.   As a first-year student, I don't claim to know the solution to everything. However, I do know that I will be unafraid to face our challenges head-on so that our campus can grow. I want to use this position to bring full transparency, authenticity, and connection to Student Assembly and our campus. I aim to bring us together on this journey.    I hope everyone has an amazing rest of the day!",
    "sources": ["https://assembly.cornell.edu/president"]
  },
  {
    "id": 5,
    "name": "Christian Flournoy",
    "grade": "Sophomore, Class of 2027",
    "position": "Executive Vice President",
    "major": "Human Biology, Health & Society",
    "photo": "/christian-flournoy.jpg",
    "bio": "My name is Christian Flournoy, and I am running to be your Student Assembly Executive Vice President (EVP). Since my freshman year, I have been committed to the betterment of the Cornell community through the Student Assembly as Freshman Rep, Undergraduate Rep At-Large, and Vice President of DEI. So far, I have effectively served the community through resolutions geared toward mental health, financial support, community representation, and more.    The future of the Student Assembly—and Cornell as a whole—requires a new framework that prioritizes maximizing student voice and community representation. As EVP, I am focused on providing the student body with Transparency, Engagement, and Advocacy. Transparency on pending resolutions, assembly functionality, and more is necessary to reinstill trust with the community and ensure people understand how we are representing them. Increased engagement of student organizations, campus leadership, and the general student body will ensure that the Student Assembly can more accurately represent the Cornell community. Advocacy has been at the heart of my work since the beginning, and I will continue to be an advocate for you and your desires.    I hope to represent you as Executive Vice President.",
    "sources": ["https://assembly.cornell.edu/executive-vice-president"]
  },
  {
    "id": 6,
    "name": "Ezra Galperin",
    "grade": "Sophomore, Class of 2027",
    "position": "Executive Vice President",
    "major": "Government and Jewish Studies",
    "photo": "/ezra-galperin.jpg",
    "bio": "Dear Cornellians,   I'm excited to run to be your Executive Vice President! My campaign is simple: less talk, more action. As your Representative-At-Large, I've focused on making real, practical changes based on your needs. You wanted meal swipes at Trillium—so as chair of the dining committee, I co-sponsored a resolution, and now dining is actively working on it. When I heard Halal meat was tough to get, I ensured that dining would expand its sources. When I saw student workers struggling, I joined with the Student Workers' Representative to make sure the assembly addressed it.   I'm here to tackle the everyday challenges we all face and to make sure resources like the Student Assembly Infrastructure Fund and special projects funding are easy for you to use. The Student Assembly shouldn't just work for you—it should work with you. As EVP, I'll always be ready to support your ideas and initiatives.   Let’s cut the nonsense and boost real student engagement together! Vote for action. Vote for accessibility. Vote for results.",
    "sources": ["https://assembly.cornell.edu/executive-vice-president"]
  },
  {
    "id": 7,
    "name": "Saad Razzak",
    "grade": "Junior, Class of 2026",
    "position": "Executive Vice President",
    "major": "Government",
    "photo": "/saad-razzak.jpg",
    "bio": "Hey!   I’m Saad Razzak, a Junior in the College of Arts & Sciences, and for the past year, I have represented CAS on the Student Assembly. Now, I’m running for Executive Vice President because I want to take what I’ve learned and make sure your voices are heard on the most important issues. If you vote for me, here’s some of what I’ll focus on:   • No prelims the night before breaks.   • Get construction under control🙄.   • Tackle Cornell’s housing crisis. In my time on the Assembly, I’ve chaired the Academic Policy Committee and fought for changes that benefit students. From pushing for clearer grading policies to securing funding for student projects at risk of being cut, I’ve always put students first. Right now, I’m working on extending the study period before finals, so stay tuned for that!   We need someone who will advocate for students and make sure our voices are heard. I know it feels like we don’t have enough power in how Cornell operates, but if we have someone who’s dedicated to fighting for what matters to us, we can make real change and foster a greater sense of community and openness on campus. If you vote for me, I will do my best every day.",
    "sources": ["https://assembly.cornell.edu/executive-vice-president"]
  },
  {
    "id": 8,
    "name": "David Suarez",
    "grade": "Class of 2027, Sophomore",
    "position": "Executive Vice President",
    "major": "American Studies; Fashion Studies",
    "photo": "/david-suarez.jpg",
    "bio": "David Equals Inclusion, DEI, Hi, I’m David Suarez and I’m running to be your Executive Vice President on the Student Assembly. As the current Vice President of Internal Operations, I have worked tirelessly to represent Cornell’s student body and always vote with students’ best interests in mind.    My goal as Executive Vice President is to work for you and ensure that Diversity, Equity, and Inclusion remain at the heart of the Assembly’s projects. It is up to us to push and challenge the university to improve for our well-being. I come to you at a time when we must fight for what we believe in, and I am here to fight. Together we form a stronger Cornell Community. I’m dedicated to ensuring marginalized communities are heard and recognized in discourse, and that Assembly leadership takes tangible steps to ensure the safety and inclusion of all students on campus.    Having served as the Assembly’s third-highest-ranking officer gives me the experience and confidence to assume the role of Executive Vice President and make your visions possible. This campaign is rooted in accessibility, advocacy, and a commitment to you. We must be the change that we hope to see. Thank You for considering me as your Executive Vice President.",
    "sources": ["https://assembly.cornell.edu/executive-vice-president"]
  },
  {
    "id": 9,
    "name": "Lydia Blum",
    "grade": "Sophomore, Class of 2027",
    "position": "College of Agriculture and Life Sciences Representative",
    "major": "Environment and Sustainability",
    "photo": "/lydia-blum.jpg",
    "bio": "Hi you! Yes, you! I would love to have your vote in this election to represent the student assembly as the CALS Representative! My name is Lydia Blum and I am a sophomore studying Environment & Sustainability. Here's some reasons why I would make a great candidate for this role: 1. I have already served as CALS Rep for one term on assembly and enjoyed being here to serve you! 2. I have cosponsored/voted in favor of important resolutions, calling for:          a. Protection of immigrant students          b.Cornell’s commitment to upholding its climate vows          c. Meal Swipes at Trillium3. I am currently a CALS Ambassador and Peer Mentor for first-year students coming into Cornell   My goals for this upcoming term include being an active member of the Environmental Committee and the Anabel’s committee, which is working to find funding sources to keep Anabel’s grocery accessible to everyone on campus. Above all, I’m here to represent you! The most important part about serving as CALS Rep is collecting your ideas and turning them into ways we can improve the Cornell community together. I would love to continue as an active member of student assembly with your help. I would love to have your vote, thank you. :)",
    "sources": [
      "https://assembly.cornell.edu/college-of-agriculture-and-life-sciences-representative"
    ]
  },
  {
    "id": 10,
    "name": "Bransen Fitzwater",
    "grade": "Freshman, Class of 2028",
    "position": "College of Agriculture and Life Sciences Representative",
    "major": "Environment & Sustainability",
    "photo": "/bransen-fitzwater.jpg",
    "bio": "My name is Bransen, and I'm from Upstate New York. Since arriving at Cornell, I have embraced this incredible community and grown deeply invested in the challenges we face as students. As your Student Assembly Representative, I will work tirelessly to ensure our voices are heard and our needs are met. My priorities include:   Protecting Academic Freedom:Recent threats to vital research funding put our academic integrity at risk. Research opportunities are essential to Cornell’s mission and to our experiences as undergraduates. I will advocate to protect funding and ensure research remains a cornerstone of our university.   Improving Campus Affordability & Accessibility:As CALS students, we often find ourselves far from dining halls during our busy days. I will push for more accessible meal plan options near class buildings so we can get the resources we pay for without disruption to our studies.   Advocating for Strong Environmental Action:Sustainability isn’t just a goal—it’s a necessity. While Cornell has set ambitious environmental targets, we as students must hold the administration accountable. Promises mean nothing without action, and I will work to ensure Cornell delivers on its sustainability commitments.",
    "sources": [
      "https://assembly.cornell.edu/college-of-agriculture-and-life-sciences-representative"
    ]
  },
  {
    "id": 11,
    "name": "Holden Hitchcock",
    "grade": "Sophomore, Class of 2027",
    "position": "College of Agriculture and Life Sciences Representative",
    "major": "Food Science",
    "photo": "/holden-hitchcock.jpg",
    "bio": "If you vote for me, I'll be holden all your considerations each Thursday at student assembly meetings! I am a current sophomore who has previously held the LGBTQIA+ Liaison-at-large position after filling the vacancy in the late fall in the student assembly. I am also a current peer advisor for CALS student services, where I have advised many students on academic and career advising. My prior experiences inform my goals as a candidate for CALS representative on the student assembly, which all tie into the larger goal of improving student life on campus and listening to the issues of CALS students. As your representative, I will hear your concerns and utilize student assembly resources to promote and improve student experiences on campus when possible. Be golden and vote for holden!",
    "sources": [
      "https://assembly.cornell.edu/college-of-agriculture-and-life-sciences-representative"
    ]
  },
  {
    "id": 12,
    "name": "Grace Dorward",
    "grade": "Junior, Class of 2026",
    "position": "College of Agriculture and Life Sciences Representative",
    "major": "Global Development and Agricultural Sciences",
    "photo": "/grace-dorward.jpg",
    "bio": "Hi CALS! I’m Grace Dorward, a Junior studying Global Development and Agricultural Sciences. At Cornell, I have learned about the joys and opportunities of being a CALS student, including Ag Day animals, hanging out with friends in Mann, and joining research labs. I also know the trials and tribulations of running to a class at Morrison Hall that I’m already late for and the million-dollar meals at Trillium. After three years, I know there is still more to learn about this community and its position as a cornerstone of the university. One of my key goals as a representative would be to learn about CALS experiences different from my own and to bridge the gap between departments, students, facilities, alumni and faculty within the college. I want to support CALS’ approach to interdisciplinary problem-solving by supporting college wide or cross-college student projects. I also support the current resolution that aims to bring a meal-swipe option to Trillium and other initiatives to increase equity on campus. Most importantly, I would like to learn more about my peers, hear your ideas and feedback, and connect CALS students to their representation! I would love to hear from you or meet you if I haven’t yet! gmd93@cornell.edu!",
    "sources": [
      "https://assembly.cornell.edu/college-of-agriculture-and-life-sciences-representative"
    ]
  },
  {
    "id": 13,
    "name": "Luigi Berinde",
    "grade": "Junior, Class of 2026",
    "position": "College of Arts and Sciences Representative",
    "major": "Physics",
    "photo": "/luigi-berinde.jpg",
    "bio": "As a Physics major in A&S planning to enroll in law school, I embody the College’s ideal of a liberal education. Being well-acquainted with both STEM and the humanities, I am equipped to articulate the wide range of ideologies and perspectives in the College.   My Chicago roots have allowed me to be at the crossroads of diverse political ideologies, with viewpoints in the Midwest shifting drastically in a matter of miles. I consider it imperative that those elected to the Student Assembly are not just merely functioning amongst diverse ideologies, but flourishing amidst them. Difference is but a catalyst for growth, and I believe we can always take that which is divisive and find where it can promote collective, invariant development.   My political philosophy is entirely based on logical reasoning and rationality. Logic is what should be guiding governance and policy. While emotions play a fundamentally crucial role in human connections, they can cloud political judgment. I advocate for decisions grounded in evidence and science, aiming for outcomes that are not only rational but also broadly beneficial. Ideally, that which is most logical should also be that which appeases the most.",
    "sources": [
      "https://assembly.cornell.edu/college-of-arts-and-sciences-representative"
    ]
  },
  {
    "id": 14,
    "name": "Dylan Carson",
    "grade": "Freshman, Class of 2028",
    "position": "College of Arts and Sciences Representative",
    "major": "Government",
    "photo": "/dylan-carson.jpg",
    "bio": "My name is Dylan and I’m a first-year interested in majoring in government! In my free time, I love hiking, meditating, and watching Survivor (maybe I’ll get on it one day).    Having been a lobbyist for an environmental advocacy group, a member of my high school’s model congress team, and as I currently serve on my dorm’s hall council, I understand the importance of both publicly standing up for what I believe in and defending the interests of others.    As a student representative, I aim to bring this understanding to the Assembly. I know that it is not my job to just project my ideas onto others but also to get to know the Cornellians that I am representing and to understand what actions I can take that will best support their well-being.   For my part, I’d love to have more outdoor, school-wide events like field days, where students can compete in outdoor activities and bond with classmates. But I want to hear what you want too! That’s why I’d create a dedicated email and Instagram that lets you share your ideas directly. Whether it’s sending me an email, or scheduling a time to have lunch, my first priority is to understand the wants and the needs of the people I represent. It’d be an honor to represent the CAS community!",
    "sources": [
      "https://assembly.cornell.edu/college-of-arts-and-sciences-representative"
    ]
  },
  {
    "id": 15,
    "name": "John Purcell",
    "grade": "Freshman, Class of 2028",
    "position": "College of Arts and Sciences Representative",
    "bio": "Hi everyone! My name is John Purcell, and I am thrilled to be running for Student Assembly Arts and Sciences Representative. As your Freshman Representative, I’ve gained valuable experience in the assembly’s procedures and workings. I’ve supported key resolutions like “Resolution 37: Protecting Immigrant Students” and “Resolution 36: Addressing Recent Extraordinary Actions of the Federal Government.” As a member of the Communications Committee, I’ve worked to keep students informed and helped create a TikTok for the assembly, which is launching soon! I want to ensure that Cornell provides the resources and opportunities students need to thrive. With all the stress students face, it’s important to have moments to unwind, and I hope to advocate for more fun student activities! I deeply care about the Cornell community and am committed to making it more inclusive, supportive, and engaging. Real change starts with listening to student concerns and taking action on issues like academic equity, mental health support, and campus accessibility. As your Arts and Sciences Representative, I will ensure every student’s voice is heard and help create resolutions that foster a stronger, more united Cornell. Please vote for me, John Purcell!",
    "photo": "/john-purcell.jpg",
    "major": "Government",
    "sources": [
      "https://assembly.cornell.edu/college-of-arts-and-sciences-representative"
    ]
  },
  {
    "id": 16,
    "name": "Jocelyn Swavy",
    "grade": "Freshman, Class of 2028",
    "position": "College of Arts and Sciences Representative",
    "major": "Government and American Studies",
    "photo": "/jocelyn-swavy.jpg",
    "bio": "As a representative for the College of Arts and Sciences, I will foster community, promote equality, and ensure that every student feels valued and supported.   One of my top priorities is to create more social events that unite A&S students beyond academic boundaries. No one should feel isolated within their major or disconnected from their peers. By strengthening our community, we can build lasting bonds and improve our overall Cornell experience.   Additionally, A&S students deserve high-quality resources that reflect the pride we have in our school. Too often, it feels like we receive the short end of the stick. As your representative I will improve our merchandise and give more back to our community so students feel appreciated.   Finally, I am passionate about advocating for more personalized career support. While A&S serves students from diverse majors, we shouldn’t have to work twice as hard to find internships and jobs. I plan to collaborate with A&S advisors to create a centralized platform where students can easily access tailored opportunities.   No matter how large our school is, we should never feel disconnected. I am dedicated to empowering students, fostering unity, and making A&S a school we’re proud to call our own.",
    "sources": [
      "https://assembly.cornell.edu/college-of-arts-and-sciences-representative"
    ]
  },
  {
    "id": 17,
    "name": "Vansh Kakra",
    "grade": "Sophomore, Class of 2027",
    "position": "Charles H. Dyson School of Business Representative",
    "bio": "As your Dyson Student Representative, I am committed to driving meaningful changes that enhance both our academic and professional experiences.  My key priorities include:  1. Securing STEM designation for Dyson to provide international students with STEM-OPT benefits while giving U.S. students a competitive edge.  2. Ensuring Dyson courses offer practical, real-world applications through constructive feedback.  3. Making job recruitment more accessible by expanding resources beyond just club affiliations.  4. Extending library and Mann Café hours to foster a more productive study and work environment.  Having worked with the government on policy initiatives, I understand the importance of advocacy and collaboration in bringing about institutional change. With experience in finance, entrepreneurship, and social impact, I am dedicated to making Dyson a place where every student can thrive.  I am here to listen, represent, and implement real change. Let’s build a better Dyson—together. I would be honored to have your vote!",
    "photo": "/vansh-kakra.jpg",
    "major": "Applied Economics and Management; Information Science",
    "sources": [
      "https://assembly.cornell.edu/charles-h.-dyson-school-of-business-representative"
    ]
  },
  {
    "id": 18,
    "name": "Cion Kim",
    "grade": "Sophomore, Class of 2027",
    "position": "College of Engineering Representative",
    "major": "Mechanical Engineering/CS",
    "photo": "/cion-kim.jpg",
    "bio": "Hello Again! I am Cion, running for Engineering Representative!   How has your past year been? As some of you may remember, in the pst year I defined our Freshmen class as the strangers in a strange land. This year, I want to describe our students as ones heading out to adventuring this strange land. College is definitely an adventure, and this year, I am running to make sure your journey is again, full of adventures and excitement.    Being Freshman Representative and engineering representative the last few years, although there were successes in parts such as increasing Slope day budget, improving the communication between students, the Projects such as improving Laundry, TCAT, and dorm facility were not that simple to tackle within a semester. I hope to continue this work throughout the next semester.    Next year I will work on:    Continuing on past projects as improving Laundry, Lighting, and Printing.    Boost campus experiences: Allocating more funding to yearly events, Festival activities, and clubs.   Having more support on student’s health and wellbeing   I’ll be the tour guide, and we will have the most amazing journey ever. Vote for Cion Kim!",
    "sources": [
      "https://assembly.cornell.edu/college-of-engineering-representative"
    ]
  },
  {
    "id": 19,
    "name": "Katherine Krishtopa",
    "grade": "Freshman, Class of 2028",
    "position": "College of Engineering Representative",
    "major": "Biomedical Engineering",
    "photo": "/katherine-krishtopa.jpg",
    "bio": "Cornellians,   An engineering class representative must be committed, passionate, and engaged within the community. My name is Katherine Krishtopa and I believe that if elected, I will be just that.   If elected, I would be committed to ensuring that every student’s voice is heard and valued. I will actively seek feedback from my peers, advocate for them, and work to create a welcoming and supportive environment for all. I know that engineering is built on collaboration, and I am dedicated to creating connections that strengthen our community. As a potential representative, I am here to be a dependable advocate for engineers, thus ensuring every voice is heard and valued. My Goals:      Support student organizations by ensuring clubs and project teams, receive the funding and resources needed   Expand networking events and create more and research opportunities   Increase resources (more access to makerspaces and software access)   Improve academic support by pushing for more tutoring resources and peer mentorship   Listen and collaborate with you, my peers!   I want to be accessible to you to ask questions, give suggestions, or just to talk. A vote for me is truly a vote for you!      Email: kvk24@cornell.edu   Instagram: katiakrishtopaa",
    "sources": [
      "https://assembly.cornell.edu/college-of-engineering-representative"
    ]
  },
  {
    "id": 20,
    "name": "Christian Tarala",
    "grade": "Sophomore, Class of 2027",
    "position": "Nolan School of Hotel Administration Representative",
    "bio": "As your current Nolan School Representative, I've had the privilege of serving our community through extensive involvement in both the Student and University Assemblies. As Chair of UA's Campus Welfare Committee, I have been spearheading initiatives for the establishment of community rest days and securing funding for feminine hygiene products across campus.   My work spans committees, from the Academic Policy committee to the Infrastructure Fund. Currently, I am developing and lobbying for resolutions to improve relationships with byline-funded organizations and enhance support for on-campus student entrepreneurship.   The hospitality industry is built on service excellence and innovation, values I've applied to my work representing you. My experience on seven different SA committees and multiple liaison positions has provided me the knowledge and connections to effectively advocate for Hotelies, and I intend to continue this ethos next year.   I'm asking for your vote to be your Nolan School representative. Together, we'll ensure that Hotelies have their voice heard while we work to build a better Cornell.",
    "photo": "/christian-tarala.jpg",
    "major": "Hotel Administration",
    "sources": [
      "https://assembly.cornell.edu/nolan-school-of-hotel-administration-representative"
    ]
  },
  {
    "id": 21,
    "name": "Max Ehrlich",
    "grade": "Junior, Class of 2026",
    "position": "School of Industrial and Labor Relations Representative",
    "major": "Industrial and Labor Relations",
    "photo": "/max-ehrlich.jpg",
    "bio": "Hi folks! I am Max Ehrlich, a Junior ILRie. As a member of progressive orgs on campus, I hope to bring progressive values and a service oriented approach to the student assembly. I will be a representative for all ILRies, not just those interested in one particular career path or organization. That’s why I pledge to have an open door policy: I will always be available to listen to any requests, needs, or issues that you have.   It’s time for the student assembly to be a body that is actually responsive to students. As your rep, I will fight for the things that students, particularly ILRies, have been asking for:-Urge Cornell to negotiate with TCAT to get all students FREE BUS RIDES, which Cornell used to provide: -Work with administration to protect STUDENTS' RIGHTS, RESEARCH, and CAREERS in the face of attacks from the Trump administration   -Fight to get ILR’s administration to recognize last year’s vote where ILRies requested to REMOVE THE 18 CREDIT REQUIREMENT    -Push for Ives bathrooms to have 2 ply toilet paper (y’all know what I’m talking about)    -Start a faculty lunch program where students can get funding for lunches where they can GET TO KNOW FACULTY MEMBERS whose research/career paths interest them.",
    "sources": [
      "https://assembly.cornell.edu/school-of-industrial-and-labor-relations-representative"
    ]
  },
  {
    "id": 22,
    "name": "Davian Gekman",
    "grade": "Sophomore, Class of 2027",
    "position": "School of Industrial and Labor Relations Representative",
    "major": "Industrial and Labor Relations",
    "photo": "/davian-gekman.jpg",
    "bio": "Hi everyone! I've been honored to serve as your ILR rep on the Student Assembly this past year. With your support, we’ve accomplished a lot: ✅ Resolution 10: All on-campus housing must have Narcan, date-rape drug tests, etc. available ✅ Resolution 26: Every housing unit must be within 5 minutes of a vending machine offering 24/7 access to: Plan B; condoms; general medical products   I'm also working on installing sleeping pods and reclining chairs around campus (Catherwood is my top priority 😉).   As Chair of the Student Health Advocacy and Pulse Committees, I’ve led new policies focused on equity, health, and student well-being. This includes working with SAPs to create a safer campus environment.   I stand for Cornell’s values (Any person, Any study), even as outside forces test them   So what's next?FIX TCAT ➡️Collaborate with TCAT to support drivers & improve serviceHOUSING ➡️Work with Cornell Admin to continue to improve housingFUN➡️Rage rooms during finals; more concerts; free merchINFRASTRUCTURE➡️Create flashing crosswalks, Improve lightingTRANSPARENCY➡️Work with ILR SGA, Hold ILR town halls, Secure org funding   ‼️BRING ELECTRIC SCOOTERS & BIKES TO CAMPUS‼️Let’s keep making every day a good day 💫 Follow @gekman4ilr",
    "sources": [
      "https://assembly.cornell.edu/school-of-industrial-and-labor-relations-representative"
    ]
  },
  {
    "id": 23,
    "name": "Daniel Dubinsky",
    "grade": "Junior, Class of 2026",
    "position": "Representative At-Large",
    "bio": "I’m running for Undesignated At-Large Representative to improve campus life, expand student opportunities, and address the financial burdens students face every day. As an ILR student, I will advocate for increased funding for student organizations, expanded mental health support with shorter wait times, and improvements to dining options and quality.    To expand opportunities, I will push for more funding for study abroad, greater access to student resource funds, and better promotion of academic and pre-professional programs that too often go underused. On affordability, I will work to reduce hidden costs such as course fees and printing charges, push for textbook price transparency, and support housing reforms that prioritize student needs over university revenue. I also want to explore a university-wide policy on generative AI that protects academic integrity while encouraging innovation and accessibility in learning.   Most importantly, I will be open, approachable, and responsive. I want to represent all students by listening directly to your experiences and turning your input into real action. My name is Daniel Dubinsky, and I would be honored to earn your vote.",
    "photo": "",
    "major": "Industrial and Labor Relations",
    "sources": ["https://assembly.cornell.edu/representative-at-large"]
  },
  {
    "id": 24,
    "name": "Lawrence Han",
    "grade": "Sophomore, Class of 2027",
    "position": "Representative At-Large",
    "bio": "Hey everyone! My name is Lawrence Han, and I’m a Hotelie who recently transferred from the College of Arts and Sciences. I'm running for Representative At-Large because I believe the Student Assembly should reflect and fight for what students actually need—whether that’s better dining experiences, stronger career support, or a more inclusive community. As someone who's navigated both sides of Cornell, I understand how overwhelming the transition can feel and how important it is to feel heard. I want to be a voice for students across all colleges and ensure that their concerns turn into action. If you ever want to share your thoughts or just chat, I’m always around and would love to hear from you all!",
    "photo": "/lawrence-han.jpg",
    "major": "Hotel Administration",
    "sources": ["https://assembly.cornell.edu/representative-at-large"]
  },
  {
    "id": 25,
    "name": "Thor Waguespack",
    "grade": "Freshman, Class of 2028",
    "position": "Representative At-Large",
    "bio": "What's up Cornellians, my name is Thor Waguespack, and I'm running to be your At-Large Representative on the Cornell Student Assembly.    The Student Assembly should serve students first – not its internal interests. Last semester, I was elected by the Freshman class to serve as Freshman Representative. In this role, I authored a resolution to ensure sidewalks are properly salted and plowed during the winter – making campus safer and more accessible for all students. I also co-authored legislation to expand communication with students so everyone can understand often overly complex Student Assembly proceedings and have a direct channel to share their voices and make their interests heard.   If elected At-large, I will continue to take this student-focused approach, advocating for simpler and more transparent policies around housing, dining, and transportation—facets of Cornell life that should be easier and more fun—so we can focus on what truly matters in our time as students here.    A vote for Thor means a vote for a more productive, responsive, and transformative Student Assembly that genuinely listens to students and delivers tangible improvements to their experience on campus. I would be honored to have your support!",
    "photo": "/thor-waguespack.jpg",
    "major": "Public Policy",
    "sources": ["https://assembly.cornell.edu/representative-at-large"]
  },
  {
    "id": 26,
    "name": "Hayden Watkins",
    "grade": "Freshman, Class of 2028",
    "position": "Representative At-Large",
    "bio": "Hello everyone! My name is Hayden Watkins and I am a first-year Public Policy student in the Brooks School. I am running as a Representative At-Large because I want to work to create more opportunity for our Cornell community.   Coming from a small town in Kentucky, I often had to work to create my own opportunities like becoming a board member of a nonprofit and planning/gathering evidence for education litigation filed against the Bluegrass State earlier this year. With federal cuts narrowing the window for many Cornellians to get internships, I want to create more career development opportunities on-campus.    I love Cornell, but sometimes college can get overwhelming! I will advocate for structured mental health support on campus, including building mental health days into our upcoming academic calendar and creating forgiveness policies for classes so students can do what is best for them. At the end of the day, we are people first and students second.   After speaking with several students, I know everyone has fantastic ideas to improve our campus. If you have anything you would like to see in SA, please send me an email or come talk to me (I love meeting new people)! Thank you!",
    "photo": "/hayden-watkins.jpg",
    "major": "Public Policy",
    "sources": ["https://assembly.cornell.edu/representative-at-large"]
  },
  {
    "id": 27,
    "name": "Eric Yao",
    "grade": "Sophomore, Class of 2027",
    "position": "Representative At-Large",
    "bio": "In the past year, I've had the privilege of representing you in the Student Assembly, advancing environmental protection resolutions, and supporting our campus community. That’s why I’m running for the Student Assembly again to ensure our government continues working for you and making your life better.    Right now, we simply cannot afford the current Student Assembly; the Student Activity fee increased by 40% to over $400, making it the most expensive in the Ivy League. To make matters worse, the last Student Activity fee hike included an 83% pay raise for the Student Assembly. I’ll work to cut the Student Activity fee and hold the Student Assembly accountable so you can keep more of your money. I will seek common-sense solutions to address the issues that matter to you.    Now, I am asking for your support because as your representative, I will get to work every day to build a better Cornell for you.",
    "photo": "",
    "major": "Operations Research",
    "sources": ["https://assembly.cornell.edu/representative-at-large"]
  },
  {
    "id": 28,
    "name": "Jinzhou Wu",
    "grade": "Freshman, Class of 2028",
    "position": "International Students Representative",
    "major": "Government and Computer Science",
    "photo": "/jinzhou-wu.jpg",
    "bio": "Hi! My name is Jinzhou Wu, and I am an international student from Beijing, China. I currently serve as the Freshman Representative, focusing on transparency, community, and student well-being.   As a member of the Communications Committee, I lead efforts to clearly communicate weekly meeting agendas and decisions on Instagram and expand SA’s outreach through a more engaging social media strategy. On the Student Health Advocacy Committee, I sponsored Resolution 26: Vending Self-Care Supplies and am working to improve mental health resources by adding bean bags and sleeping pods to libraries. I also helped pass Resolution 37: Protecting Immigrant Students, addressing the challenges international students face due to administrative policies.   My term as Freshman Representative has provided me with the training and experience needed to take on greater initiatives next term. As an international student, I understand firsthand the challenges we face, from administrative hurdles to community integration. With ongoing executive orders affecting international students, I will advocate for our rights, safety, and welfare while continuing efforts in transparency, community, and improving student life.   I’d be honored to have your support!",
    "sources": [
      "https://assembly.cornell.edu/international-students-representative"
    ]
  },
  {
    "id": 29,
    "name": "Alexander Walters",
    "grade": "Freshman, Class of 2028",
    "position": "LGBTQIA+ Students Representative",
    "major": "Public Policy",
    "photo": "/alexander-walters.jpg",
    "bio": "What do students want most from their representative? Probably the same thing I’d want- relatability. How ‘representative’ is a candidate if you don’t share experiences with them? If you can’t have a real conversation with them? I’d argue not very. I’m running because I want to change that. I won’t just vote for whatever proposition seems best; I want to know what you really think, and how you would vote if given the chance. Whether it’s over coffee, or just walking around campus, I’d always be ready to hear what you have to say. I want to be the kind of representative you feel comfortable talking to, because that’s what real representation is.",
    "sources": ["https://assembly.cornell.edu/lgbtqia+-students-representative"]
  },
  {
    "id": 30,
    "name": "Daniel Addoquaye",
    "grade": "Freshman, Class of 2028",
    "position": "Minority Students Representative",
    "bio": "Hello everyone! My name is Daniel Addoquaye, and I am running to be elected as the Minority Students Liaison At-Large.   As a Freshman Representative this year, I advocated for safety and increased communication by working on resolutions to expand dialogue between the Assembly and the undergraduate student body, as well as co-authoring legislation that promotes student sidewalk safety.    As the Minority Students Liaison At-Large next year, I will continue advocating for resolutions that support all minority communities across campus. I will leverage my knowledge of university proceedings, operations, and inner workings to strengthen the impact of my work, delivering real, tangible outcomes for you, the undergraduate community.   I plan to work closely with the Diversity Committee and the Academic Policy Committee to ensure your undergraduate experience is marked by safety, comfort, and the freedom to advocate for yourself. This builds on the foundation I set as a Freshman Representative.   When we began this journey together, you chose me to be your solid ground, and for that, I am incredibly grateful. Now, I’m asking you to choose again — a candidate who will continue to ensure you have safe and steady footing.",
    "photo": "/daniel-addoquaye.jpg",
    "major": "Public Policy",
    "sources": ["https://assembly.cornell.edu/minority-students-representative"]
  },
  {
    "id": 31,
    "name": "Kennedy Young",
    "grade": "Freshman, Class of 2028",
    "position": "Minority Students Representative",
    "major": "Public Policy",
    "photo": "/kennedy-young.jpg",
    "bio": "Cornell’s diversity is its strength, but representation means more than just presence—it requires action. As a freshman in the Brooks School of Public Policy, from the moment I stepped foot on the Hill, I have worked to advance minority voices through Black Students United, Cornell ACLU, and, more recently, the CU Prison Initiative and Tenants Program. Through these efforts, I continue to address injustices that disproportionately affect our communities. I’m running to ensure that minority voices are not just heard but drive real change on campus.   I am running on three key principles: Empower. Advocate. Deliver. Empower – Amplifying student voices and ensuring underrepresented communities have a direct line to decision-making spaces.Advocate – Pushing for policies that reflect our needs, from cultural funding to institutional accountability.Deliver – Turning concerns into tangible results by bridging the gap between students and administration.   Cornell’s minority students deserve leadership that doesn’t just listen but acts. As your representative, I will work to create policies that reflect our realities and push for solutions that matter. Let’s build a campus where equity isn’t just a promise—it’s a priority.",
    "sources": ["https://assembly.cornell.edu/minority-students-representative"]
  },
  {
    "id": 32,
    "name": "Hayden Spector",
    "grade": "Junior, Class of 2026",
    "position": "Students with Disabilities Representative",
    "bio": "Hi! I’m a junior studying Chemical Engineering, and I live with hypermobile Ehlers-Danlos Syndrome and other related conditions. I started facing serious health issues in high school, which sparked my passion for disability advocacy. Despite the obstacles, I became an Eagle Scout, made it to Cornell, and started speaking openly about my challenges. During my sophomore year, I struggled with a severe health issue and found that support was often limited, both socially and academically. Now that my health has improved, I’m more committed than ever to helping other students navigate similar challenges. Living with a disability has shaped every part of my academic and personal life, and I want to improve accessibility and support systems, especially for students with physical disabilities and mental health conditions. Everyone deserves to feel seen, supported, and empowered on this campus.",
    "photo": "/hayden-spector.jpg",
    "major": "Chemical Engineering",
    "sources": [
      "https://assembly.cornell.edu/students-with-disabilities-representative"
    ]
  },
  {
    "id": 33,
    "name": "Aiden Vallecillo",
    "grade": "Junior, Class of 2026",
    "position": "Student Workers Representative",
    "bio": "As a dedicated advocate for labor and workers' rights, I hope to use this position to advance the well-being and privileges of student workers. As tuition and living expenses continue to rise, the reality is that many students are forced to take on jobs without which they would be unable to support themselves. These student workers should be supported in their dual mission of continuing their education and assisting in the day-to-day functions of the University. Without student workers, this campus would not function; however, these same workers are subject to arbitrary scheduling, unfair treatment, and low pay. Student workers deserve dignity and respect, and I hope to use this position to ensure all working students' voices are heard.",
    "photo": "/aiden-vallecillo.jpg",
    "major": "Industrial and Labor Relations",
    "sources": ["https://assembly.cornell.edu/student-workers-representative"]
  },
  {
    "id": 34,
    "name": "Michael Yum",
    "grade": "Freshman, Class of 2028",
    "position": "Student Workers Representative",
    "major": "Viticuture & Enology",
    "photo": "",
    "bio": "Student-Workers & Cornellians at large,       As a student-worker who has worked in 15+ halls across campus, I understand the challenges we face -- balancing work with school, ensuring respect in the workplace, earning enough money, and finding a work schedule that works for you -- all while trying to maintain your personal well-being, and a healthy social life. I also understand the obstacles prospective student-workers face in finding a job that fits around their class schedules, and prior commitments. I am running to be your Student Workers Representative to protect student-workers from budget cuts, unfair dismissals, and unsafe work environements.    I will advocate for policies that make it easier for undergraduates to find a job that works for them.    This includes pushing for flexbile scheduling that fits around your pre-existing commitments, a secure wage that fulfills your financial needs, as well as increased transparency of scheduling and what a campus job entails prior to applying.    A campus job is a necessity for many, and beneficial for many more - providing critical work experience, personal development, networking, and close friendships. With your support, we can build a better working experience at Cornell together!",
    "sources": ["https://assembly.cornell.edu/student-workers-representative"]
  },
  {
    "id": 35,
    "name": "Eeshaan Chaudhuri",
    "grade": "Sophomore, Class of 2027",
    "position": "Undergraduate Representative to the University Assembly",
    "major": "Public Policy",
    "photo": "/eeshaan-chaudhuri.jpg",
    "bio": "My name is Eeshaan Chaudhuri, and I'm a sophomore in the Brooks School studying Public Policy. This year, I’ve served as the Brooks Representative on the Student Assembly, as well as on the University Assembly Campus Codes and PULSE Committees.   Beyond student government, I stay actively involved on campus as a Tour Guide, Orientation Leader, Teaching Assistant, and Research Assistant. I care deeply about Cornell and ensuring that students have a real voice in shaping its policies. That’s why I believe the University Assembly is the best place to push for meaningful change.   This past year, I:   - Led the first initiative to bring Meal Swipes to Trillium (Breakfast + Meals on Wheels, coming soon!)   - Helped reinstate and amend Cornell’s Climate & Sustainability Goals.   - Collaborated to allocate over $50,000 for campus infrastructure improvements, including crosswalks on West and campus kiosks.   If elected as your Undergraduate Representative to the University Assembly, I will continue advocating for policies that improve student life and make a tangible impact. I’d love the opportunity to keep working for you—thank you for your consideration!",
    "sources": [
      "https://assembly.cornell.edu/undergraduate-representative-to-the-university-assembly"
    ]
  },
  {
    "id": 36,
    "name": "Khanh Nguyen",
    "grade": "Sophomore, Class of 2027",
    "position": "Undergraduate Representative to the University Assembly",
    "major": "Economics and Classics",
    "photo": "/khanh-nguyen.jpg",
    "bio": "Hey! My name is Khanh Nguyen, a sophomore studying Economics and Classics, and I am running to be your Undergraduate Representative to the University Assembly.   Cornell brings together a community of diverse voices and ambitions. As your representative, I will ensure that undergraduate concerns are addressed at the highest levels of university governance. While I have not previously served on the Student Assembly, I have thoroughly enjoyed my time at Cornell and am grateful to be a part of this vibrant community for what it has done for me. With that said, I am eager for the opportunity to give back. I believe the current Student Assembly has done an outstanding job navigating a period of administrative and structural change, and I would love to build on that momentum. Drawing on my past and current leadership and research experiences, I prioritize execution over empty promises, focusing on steady, meaningful progress rather than abrupt shifts. By actively listening to student concerns and advocating for tangible solutions, I will work to ensure that Cornell becomes a place where every student feels supported and empowered.   Please feel free to contact me at kpn27@cornell.edu. I would love to get to know you and hear your ideas!",
    "sources": [
      "https://assembly.cornell.edu/undergraduate-representative-to-the-university-assembly"
    ]
  },
  {
    "id": 37,
    "name": "Saanya Agarwal",
    "grade": "Sophomore, Class of 2027",
    "position": "Women's Issues Representative",
    "bio": "As a sophomore studying Global and Public Health on the pre-medical track at Cornell, I am excited to run for Women's Issues Representative. My experience in healthcare and community service has prepared me to tackle critical issues on campus. Moreover, as a Meinig Family National Scholar, I have worked closely with university officials, including my current mentor, the Associate Vice President of Public Safety, to understand and improve responses to student needs, including sexual assault and mental health support.      Firstly, I aim to focus my efforts on implementing and enforcing more anti-sexual assault measures, such as bystander intervention trainings, self defense classes, increased awareness about support services for survivors, and increased transparency between the administration and undergraduate body.    Secondly, I aim to improve access to essential products by expanding menstrual product availability in public restrooms and installing vending machines for reproductive products like Plan B in areas like West Campus.   Let's work together to create a safer, more inclusive Cornell.",
    "photo": "/saanya-agarwal.jpg",
    "major": "Global and Public Health Sciences",
    "sources": ["https://assembly.cornell.edu/women's-issues-representative"]
  },
  {
    "id": 38,
    "name": "Kaitlyn Bell",
    "grade": "Class of 2028, Freshman",
    "position": "Women's Issues Representative",
    "major": "Industrial and Labor Relations",
    "photo": "",
    "bio": "Hi, I’m Kaitlyn Bell! I’m running for Women’s Issues Representative because I’m passionate about advocating for women’s voices and creating an empowering environment. As a member of the Cornell Society for Women in Business, I’m proud to promote leadership and uplift women in our community.   Community and advocacy are core to my values. As an ILR major, I’m committed to advocacy for all, understanding the importance of representation in student matters. My background in speech and debate has helped me develop strong communication skills, and I’m confident in my ability to listen, speak up, and act on issues that matter to you.   As a writer for the Cornell Daily Sun, I’m constantly learning about our community’s needs and experiences, and I want to use that knowledge to fight for positive change. Whether addressing big or small issues, I’m here to advocate for equal opportunities, women’s rights, and an inclusive environment.   If elected, I’ll prioritize creating opportunities for connection, empowerment, and access to resources for all women at Cornell. Your voice matters, and I’ll amplify it. Please consider voting for me to help create a Cornell where every woman feels heard, supported, and valued. Go Big Red!",
    "sources": ["https://assembly.cornell.edu/women's-issues-representative"]
  }
]
