{
  "candidates": [
    {
      "name": "Thomas Provost",
      "currentRole": "Board of Education Member, Orchard Park Central School District",
      "party": "Non-Partisan",
      "image_url": "https://www.opschools.org/cms/lib/NY01913396/Centricity/Domain/4/Provost%20Tom.jpg",
      "linkedin_url": "N/A",
      "campaign_website_url": "N/A",
      "bio": "Thomas Provost is a lifelong resident of Orchard Park and a graduate of Orchard Park High School. He holds a Bachelor's degree in Finance from Canisius College and an MBA from the University at Buffalo. He works as a Senior Vice President in Commercial Banking at M&T Bank. Provost and his wife have three children who attend or have graduated from Orchard Park schools. He has been involved in various community activities, including coaching youth sports. He was first elected to the Board of Education in 2021.",
      "key_policies": [
        "Maintaining fiscal responsibility and strong financial oversight.",
        "Supporting high academic standards and student achievement.",
        "Ensuring safe and secure learning environments.",
        "Promoting transparency and communication with the community.",
        "Supporting athletic and extracurricular programs."
      ],
      "home_city": "Orchard Park",
      "hometown_state": "New York",
      "additional_notes": "Incumbent who was re-elected in the May 2024 election for a three-year term ending June 30, 2027.",
      "sources": [
        "Orchard Park Central School District Website - Meet the Candidates 2024",
        "Orchard Park Central School District Website - Board Members Page",
        "The Orchard Park Bee - Election Coverage (May 2024)"
      ]
    },
    {
      "name": "Ryan Anderson",
      "currentRole": "Board of Education Member, Orchard Park Central School District",
      "party": "Non-Partisan",
      "image_url": "https://www.opschools.org/cms/lib/NY01913396/Centricity/Domain/4/Anderson%20Ryan.jpg",
      "linkedin_url": "N/A",
      "campaign_website_url": "N/A",
      "bio": "Ryan Anderson has been a resident of Orchard Park since 2013. He holds a Bachelor's degree in Finance from Canisius College. He works as a Financial Advisor and Growth & Development Director at Northwestern Mutual. Anderson and his wife have three children attending Orchard Park schools. He has been involved in school activities, including the District Safety Committee and volunteering with the PTA. He was first elected to the Board of Education in 2021.",
      "key_policies": [
        "Focusing on student safety and well-being.",
        "Supporting strong academic programs.",
        "Ensuring fiscal responsibility and efficient use of resources.",
        "Enhancing communication between the district and families.",
        "Promoting community involvement in schools."
      ],
      "home_city": "Orchard Park",
      "hometown_state": "New York",
      "additional_notes": "Incumbent who was re-elected in the May 2024 election for a three-year term ending June 30, 2027.",
      "sources": [
        "Orchard Park Central School District Website - Meet the Candidates 2024",
        "Orchard Park Central School District Website - Board Members Page",
        "The Orchard Park Bee - Election Coverage (May 2024)"
      ]
    },
    {
      "name": "Luis Jesús Villalpando",
      "currentRole": "Director of Student Engagement, University at Buffalo / 2024 Candidate",
      "party": "Non-Partisan",
      "image_url": "https://www.opschools.org/cms/lib/NY01913396/Centricity/Domain/1005/Luis%20Villalpando.jpg",
      "linkedin_url": "https://www.linkedin.com/in/luisjesusvillalpando/",
      "campaign_website_url": "N/A",
      "bio": "Luis Jesús Villalpando has been a resident of Orchard Park since 2019. He holds a Bachelor's degree in Political Science and Spanish from the University of Michigan and a Master's degree in Higher Education Administration from the University of Texas at San Antonio. He currently serves as the Director of Student Engagement at the University at Buffalo. Villalpando and his wife have two children attending Orchard Park schools. His background includes experience in diversity, equity, and inclusion initiatives in educational settings.",
      "key_policies": [
        "Promoting diversity, equity, and inclusion within the district.",
        "Enhancing student support services and mental health resources.",
        "Strengthening communication and engagement with diverse families.",
        "Supporting innovative teaching and learning practices.",
        "Ensuring equitable opportunities for all students."
      ],
      "home_city": "Orchard Park",
      "hometown_state": "New York",
      "additional_notes": "Ran for one of the two available Board of Education seats in the May 2024 election but was not elected.",
      "sources": [
        "Orchard Park Central School District Website - Meet the Candidates 2024",
        "The Orchard Park Bee - Election Coverage (May 2024)",
        "LinkedIn Profile"
      ]
    },
    {
      "name": "Tijuana Klas",
      "currentRole": "Healthcare Professional / 2024 Candidate",
      "party": "Non-Partisan",
      "image_url": "https://www.opschools.org/cms/lib/NY01913396/Centricity/Domain/1005/Tijuana%20Klas.jpg",
      "linkedin_url": "N/A",
      "campaign_website_url": "N/A",
      "bio": "Tijuana Klas has been a resident of Orchard Park for over 10 years. She works in healthcare at Roswell Park Comprehensive Cancer Center. Klas and her husband have two children attending Orchard Park schools. She has been an active volunteer in the district, serving on the PTA, including roles as treasurer and Reflections Chair, and volunteering with various school events and committees like the District Wellness Committee.",
      "key_policies": [
        "Advocating for student mental health and well-being.",
        "Supporting teachers and staff.",
        "Enhancing communication between the board, administration, and parents.",
        "Promoting inclusivity and a positive school climate.",
        "Ensuring resources are allocated effectively to support student needs."
      ],
      "home_city": "Orchard Park",
      "hometown_state": "New York",
      "additional_notes": "Ran for one of the two available Board of Education seats in the May 2024 election but was not elected.",
      "sources": [
        "Orchard Park Central School District Website - Meet the Candidates 2024",
        "The Orchard Park Bee - Election Coverage (May 2024)"
      ]
    }
  ]
}
