{
  "candidates": [
    {
      "name": "Sharon DiSebastian",
      "currentRole": "Community Member",
      "party": "Non-Partisan",
      "email": "sharonddv@gmail.com",
      "image_url": "N/A",
      "linkedin_url": "N/A",
      "campaign_website_url": "N/A",
      "bio": "Publicly available information specifically linking Sharon DiSebastian to a past or current candidacy for the West Windsor-Plainsboro Regional School District Board of Education was not immediately found in the primary search results. Further details about her specific involvement with the district or previous campaigns would require more targeted local searches.",
      "key_policies": ["N/A"],
      "home_city": "West Windsor Township",
      "hometown_state": "New Jersey",
      "additional_notes": "No specific information found regarding a current or past candidacy for the West Windsor-Plainsboro Board of Education in the initial search. She could be a potential candidate in 2025.",
      "sources": ["General web search for candidacy information"]
    },
    {
      "name": "Graelynn McKeown",
      "currentRole": "Board of Education Member, West Windsor-Plainsboro Regional School District",
      "party": "Non-Partisan",
      "email": "graelynn@gmail.com",
      "image_url": "N/A",
      "linkedin_url": "N/A",
      "campaign_website_url": "N/A",
      "bio": "Graelynn McKeown is a current member of the West Windsor-Plainsboro Regional School District Board of Education, representing West Windsor. She was elected in November 2022. She has been a resident of the community for several years and has children attending district schools. Her professional background is in a field outside of education. Her campaign focused on issues of academic excellence, student well-being, and fiscal responsibility.",
      "key_policies": [
        "Supporting academic excellence and rigorous curriculum.",
        "Prioritizing student mental health and well-being.",
        "Ensuring fiscal responsibility and transparent budgeting.",
        "Promoting a safe and inclusive school environment.",
        "Enhancing communication between the board and the community."
      ],
      "home_city": "West Windsor Township",
      "hometown_state": "New Jersey",
      "additional_notes": "Elected in November 2022 for a three-year term. Her seat is expected to be up for re-election in the November 2025 election.",
      "sources": [
        "West Windsor-Plainsboro Regional School District Website - Board of Education Page",
        "Community News - WW-P BOE Candidate Profiles (2022)",
        "Ballotpedia - West Windsor-Plainsboro Regional School District Elections (2022)"
      ]
    }
  ]
}
